Automation5/src/test/resources/xml_files/hello.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://learnwebservices.com/services/hello">
    <soapenv:Header/>
    <soapenv:Body>
        <hel:HelloRequest>
            <hel:Name>Daniel</hel:Name>
        </hel:HelloRequest>
    </soapenv:Body>
</soapenv:Envelope>